lvx/base/Catalogs/бит_НастройкиЗагрузкиИзExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_НастройкиЗагрузкиИзExcel</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяЛиста</Name>
					<Comment>Имя листа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>31</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНачальнойКолонки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиСИменамиКолонок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьНестандартныйАлгоритмПоиска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПоискаСуществующихОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗаписьюОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗаписиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДанных</Name>
							<Comment>"Шапка, Табличные части"</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяВФайле</Name>
							<Comment>Имя в файле</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита в который необходимо загрузить значение</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип реквизита</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипыЗагружаемыхОбъектовИзExcel</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Comment>Имя объекта</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПользовательскиеФункции</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитПоиска</Name>
							<Comment>Реквизит поиска объекта</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючевоеПоле</Name>
							<Comment>Ключевое поле, для проверки заполненности</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоУмолчанию</Name>
							<Comment>Значение по умолчанию</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоДляПустых</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыгружатьСписок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыражениеПредставления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеНастроек</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НастройкиУстановлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрТип</Name>
							<Comment>Доступные типы значений в строковом представлении для выгрузки списков</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_НастройкиЗагрузкиИзExcel/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мЖирныйШрифт Экспорт; // Хранит жирный шрифт для выделения типа произвольный код.
Перем мЦветНеДоступно; // Хранит цвет недоступных ячеек дерева данных.
Перем мСтруктураСсылочныхТипов Экспорт; // Хранит структуру имен - ссылочный типов.
Перем мСтруктураПростыхТипов; // Хранит структуру имен - простейших типов.
Перем мСтруктураРеквизитПоиска; // Хранит структуру имен - реквизитов поиска по умолчанию.
Перем мСоотИменТиповДляПолейБезСопоставления Экспорт; // Хранит соответствие имен - ссылочный типов для полей без сопоставления.
Перем мСоотТипВидОбъекта; // Хранит соответствие тип - вид объекта.
Перем мКартинкиТипов; // Хранит соответствие картинок для типов.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
    
    Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
    // Если это установка/снятие пометки удаления, тогда.
    Если Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
        Возврат;
    КонецЕсли;
    
    // Проверим принадлежность элемента/группы к предопределеннм группам справочника.
    ПроверитьПринадлежностьНастройкиКПредопределеннымГруппам(Отказ);
    
    Если Не Отказ Тогда
        
        // Проверим правильность заполнения настройки загрузки.
        ПроверитьПравильностьЗаполненияНастройкиЗагрузки(Отказ);
        
        // Если это основная настройка для объекта, тогда.
        Если Не Отказ И Не ЭтоГруппа И ОсновнаяНастройка Тогда
        
            Запрос = Новый Запрос;
            Запрос.УстановитьПараметр("ТекОбъект", Объект);
            Запрос.УстановитьПараметр("ТекСсылка", Ссылка);
            
            Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
                |    бит_НастройкиЗагрузкиИзExcel.Ссылка
                |ИЗ
                |    Справочник.бит_НастройкиЗагрузкиИзExcel КАК бит_НастройкиЗагрузкиИзExcel
                |ГДЕ
                |    бит_НастройкиЗагрузкиИзExcel.Ссылка <> &ТекСсылка
                |    И бит_НастройкиЗагрузкиИзExcel.Объект = &ТекОбъект
                |    И бит_НастройкиЗагрузкиИзExcel.ОсновнаяНастройка";
                
            Выборка = Запрос.Выполнить().Выбрать();
            
			Пока Выборка.Следующий() Цикл
				
                ТекСпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
                ТекСпрОбъект.ОсновнаяНастройка 	   = Ложь;
				ТекСпрОбъект.ОбменДанными.Загрузка = Истина;
				
				бит_ОбщегоНазначения.ЗаписатьСправочник(ТекСпрОбъект,, "Ошибки");
				
            КонецЦикла;
                
        КонецЕсли;
        
    КонецЕсли; // Если Не Отказ Тогда       
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает картинку соответствующая типу.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.
// 
// Возвращаемое значение:
//  Картинка.
// 
Функция ПолучитьКартинкуПоТипу(ТекущаяСтрока, ЭтоВыборТипа = Ложь) Экспорт
    
    Картинка = Неопределено;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат Картинка;
	КонецЕсли;
	
    Если ЭтоВыборТипа Тогда
        ТипОбъекта = ТекущаяСтрока;
	Иначе
		ТипОбъекта = ТекущаяСтрока.Тип;
	КонецЕсли;
	
	Картинка = мКартинкиТипов.Получить(ТипОбъекта);
	Картинка = ?(Картинка = Неопределено, БиблиотекаКартинок.бит_од_Реквизит, Картинка);
        
    Возврат Картинка;
    
КонецФункции // ПолучитьКартинкуПоТипу()

// Функция возвращает список значений для выбора.
// 
// Параметры:
//  ТаблицаРеквизитов - ТаблицаЗначений, Массив.
//  ЭтоМассив         - Булево.
// 
// Возвращаемое значение:
//  СписокЗначений.
// 
Функция ЗначенияДляВыбораПоля(ТаблицаРеквизитов, ЭтоМассив = Ложь, Картинка = Неопределено) Экспорт
    
    Список = Новый СписокЗначений;
    
    Если Не ЭтоМассив Тогда        
        Для Каждого ТекСтрока Из ТаблицаРеквизитов Цикл
            Список.Добавить(ТекСтрока.ИмяРеквизита, ТекСтрока.Представление,, Картинка);
        КонецЦикла;        
    Иначе
        Для Каждого ТекЭлемент Из ТаблицаРеквизитов Цикл
            Список.Добавить(ТекЭлемент,,, ?(ТипЗнч(Картинка) = Тип("Картинка"), Картинка, ПолучитьКартинкуПоТипу(ТекЭлемент, Истина)));
        КонецЦикла;
    КонецЕсли;
	
    Возврат Список;
    
КонецФункции // ЗначенияДляВыбораПоля()

// Функция возвращает реквизиты объекта для выбора.
// 
// Параметры:
//  ВидДанных - Строка, "Шапка, ИмяТабЧасти - объекта".
// 
// Возвращаемое значение:
//  ТаблицаРеквизитов - ТаблицаЗначений.
// 
Функция ПолучитьРеквизитыОбъектаДляВыбора(ВидДанных = "") Экспорт
    
    СтруктураСвойстОбъекта = Новый Структура;
    СтруктураСвойстОбъекта.Вставить("ВидОбъекта", ВидОбъекта);
    СтруктураСвойстОбъекта.Вставить("ИмяОбъекта", ИмяОбъекта);
	СтруктураСвойстОбъекта.Вставить("ВидДанных" , ВидДанных);
    
    ТаблицаРеквизитов = бит_ОбменДанными.ПолучитьРеквизитыОбъектаЗагрузки(мСтруктураСсылочныхТипов, СтруктураСвойстОбъекта);
    
    Возврат ТаблицаРеквизитов;
    
КонецФункции // ПолучитьРеквизитыОбъектаДляВыбора()

// Функция возвращает таблицу объектов составного реквизита для выбора.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.
// 
// Возвращаемое значение:
//  ТаблицаОбъектов - ТаблицаЗначений.
// 
Функция ДанныеОбъектовСоставногоРеквизитаДляВыбора(ТекущаяСтрока) Экспорт
    
    ТаблицаОбъектов = Новый ТаблицаЗначений;
    ТаблицаОбъектов.Колонки.Добавить("ИмяРеквизита");
    ТаблицаОбъектов.Колонки.Добавить("Представление");
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат ТаблицаОбъектов;
    КонецЕсли;
    
    Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИмяРеквизита) Тогда
        ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Объекты не получены для выбора. Неуказано имя реквизита.';
												   |en='Objects are not prepared for selection. Unspecified name props.'"));
        Возврат ТаблицаОбъектов;
    КонецЕсли;
    
	СимволыДляПоиска = ВидОбъекта;
	ИмяРеквизита	 = ТекущаяСтрока.ИмяРеквизита;
	ТипыРеквизита 	 = Новый Массив;
	
	Попытка
		
		// Если это регистр сведений, тогда.
		Если СимволыДляПоиска = "РегистрСведений" Тогда
			
			// Получим реквизит регистра сведений.
			ТекРеквизит = бит_ОбменДанными.ПолучитьЭлементДанныхРегистраСведедний(ИмяОбъекта, ИмяРеквизита);
			
			Если Не ТекРеквизит = Неопределено Тогда
				ТипыРеквизита = ТекРеквизит.Тип.Типы();
			КонецЕсли;
				
		Иначе
			// Иначе, это не регистр сведений.
			
			РезСтруктура = мСтруктураСсылочныхТипов[СимволыДляПоиска];
			МетаОбъекта  = Метаданные[РезСтруктура.ИмяКоллекции][ИмяОбъекта];
			
			// Если это дополнительные реквизиты, тогда.
			Если ИмяРеквизита = "Родитель" Тогда
				ИмяТипаОбъекта = бит_ОбменДанными.ПолучитьИмяТипаОбъекта(ИмяОбъекта, ВидОбъекта);
				ТипыРеквизита.Добавить(Тип(ИмяТипаОбъекта));
				
			ИначеЕсли ИмяРеквизита = "Владелец" Тогда
				
				Для Каждого ТекВладелец Из МетаОбъекта.Владельцы Цикл
					
					// Получим тек. вид объекта.
					ТекВидОбъекта = бит_ОбменДанными.ПолучитьВидОбъектаПоМетаданным(ТекВладелец);
					
					// Получим имя типа объекта.
					ПервыйТипТипов = Тип(бит_ОбменДанными.ПолучитьИмяТипаОбъекта(ТекВладелец.Имя, ТекВидОбъекта));
					
					ТипыРеквизита.Добавить(ПервыйТипТипов);
					
				КонецЦикла;
				
			Иначе
				
				Если ТекущаяСтрока.ВидДанных = "Шапка" Тогда
					ТипыРеквизита = МетаОбъекта.Реквизиты[ИмяРеквизита].Тип.Типы();
				ИначеЕсли Лев(ТекущаяСтрока.ВидДанных, 9) = "Движения_" Тогда 
					ТаблицаРеквизитов = ПолучитьРеквизитыОбъектаДляВыбора(ТекущаяСтрока.ВидДанных);
					ОписаниеРеквизита = ТаблицаРеквизитов.Найти(ИмяРеквизита, "ИмяРеквизита");
					Если ОписаниеРеквизита <> Неопределено Тогда
						Если ТипЗнч(ОписаниеРеквизита.Реквизит) = Тип("ОбъектМетаданных") Тогда
							ТипыРеквизита = ОписаниеРеквизита.Реквизит.Тип.Типы();
						Иначе
							ТипыРеквизита = ОписаниеРеквизита.Реквизит.Типы();
						КонецЕсли;
					Иначе
						ТипыРеквизита = Новый Массив;
					КонецЕсли;
				Иначе
					ТипыРеквизита = МетаОбъекта.ТабличныеЧасти[ТекущаяСтрока.ВидДанных].Реквизиты[ИмяРеквизита].Тип.Типы();
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; // Если СимволыДляПоиска = "РегистрСведений" Тогда.
		
		СимволыТипаСтрокиДляОтбора = бит_ОбменДанными.ПолучитьВидОбъектаИзСоответствия(мСоотТипВидОбъекта
																							,ТекущаяСтрока.Тип);
		
		Для Каждого ТекТип Из ТипыРеквизита Цикл
			
			// Получим вид объекта реквизита.
			ВидОбъектаРеквизита = бит_ОбменДанными.ПолучитьВидОбъектаПоТипу(ТекТип);
			
			Если Не ВидОбъектаРеквизита = СимволыТипаСтрокиДляОтбора Тогда
				Продолжить;
			КонецЕсли;
			
			РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъектаРеквизита];
			
			МассивТипов = Новый Массив;
			МассивТипов.Добавить(ТекТип);
			ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
			
			СтруктураОбъекта = бит_ОбменДанными.ПолучитьИмяОбъектаПоОписаниюТипов(ОписаниеТипов, 
																						РезСтруктура.ИмяКоллекции,
																						РезСтруктура.НачалоИмениТипа + "Ссылка");
			Если СтруктураОбъекта <> Неопределено Тогда																			
																						
				НовСтрока = ТаблицаОбъектов.Добавить();
				НовСтрока.ИмяРеквизита  = СтруктураОбъекта.Имя;
				НовСтрока.Представление = СтруктураОбъекта.Синоним;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		ТекстСообщения = НСтр("ru='Объекты не получены для выбора. Неправильно указано имя реквизита.';
							  |en='Objects are not prepared for selection. Incorrectly stated the name of the props.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат ТаблицаОбъектов;
	
КонецФункции // ДанныеОбъектовСоставногоРеквизитаДляВыбора()

// Функция возвращает массив типов реквизита для выбора.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.
//  Сообщать      - Булево (По умолчанию = Истина).
// 
// Возвращаемое значение:
//  Массив - массив типов.
// 
Функция ТипыРеквизитаДляВыбора(ТекущаяСтрока, Сообщать = Истина) Экспорт
    
    МассивТипов = Новый Массив;
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат МассивТипов;
    КонецЕсли;
	
	ИмяРеквизита = ТекущаяСтрока.ИмяРеквизита;
	
	Если Не ЗначениеЗаполнено(ИмяРеквизита) Тогда		
		Если Сообщать Тогда
			ТекстСообщения = НСтр("ru='Типы не получены для выбора. Неуказано имя реквизита.';
								  |en='Types are not received for selection. Unspecified name props.'");			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;			
        Возврат МассивТипов;
    КонецЕсли;
	
	СимволыДляПоиска = ВидОбъекта;
	ТекРеквизит		 = Неопределено;
	
	Попытка
		
		// Если это регистр сведений, тогда.
		Если СимволыДляПоиска = "РегистрСведений" Тогда
			
			Если ИмяРеквизита = "Период" Тогда
				МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Дата);
				
			ИначеЕсли Не ИмяРеквизита = "Без_Сопоставления" Тогда	
				
				// Получим реквизит регистра сведений.
				ТекРеквизит = бит_ОбменДанными.ПолучитьЭлементДанныхРегистраСведедний(ИмяОбъекта, ИмяРеквизита);
				
			КонецЕсли;
			
		Иначе
			// Иначе, это не регистр сведений.
			
			РезСтруктура = мСтруктураСсылочныхТипов[СимволыДляПоиска];
			МетаОбъекта  = Метаданные[РезСтруктура.ИмяКоллекции][ИмяОбъекта];
			
			// Если это справочник, тогда.
			Если СимволыДляПоиска = "Справочник" Тогда
				
				Если ИмяРеквизита = "Код" Тогда
					
					Если МетаОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число Тогда
						МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Число);
					Иначе
						МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Строка);
					КонецЕсли;
					
				ИначеЕсли ИмяРеквизита = "Наименование" Тогда
					МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Строка);
					
				ИначеЕсли ИмяРеквизита = "Родитель" Тогда
					РезСтруктура = мСтруктураСсылочныхТипов[СимволыДляПоиска];
					МассивТипов.Добавить(РезСтруктура.Тип);
					
				ИначеЕсли ИмяРеквизита = "Владелец" Тогда
					
					Для Каждого ТекВладелец Из МетаОбъекта.Владельцы Цикл
						
						// Получим тек. вид объекта.
						ТекВидОбъекта = бит_ОбменДанными.ПолучитьВидОбъектаПоМетаданным(ТекВладелец);
						
						// Получим имя типа объекта.
						ПервыйТипТипов = бит_ОбменДанными.ПолучитьИмяТипаОбъекта(ТекВладелец.Имя, ТекВидОбъекта);
						
						// Получим вид объекта реквизита.
						ВидОбъектаРеквизита = бит_ОбменДанными.ПолучитьВидОбъектаПоТипу(Тип(ПервыйТипТипов));
						
						РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъектаРеквизита];
						МассивТипов.Добавить(РезСтруктура.Тип);
						
					КонецЦикла;
					
				ИначеЕсли ИмяРеквизита = "ЭтоГруппа" Тогда
					МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Булево);
					
				КонецЕсли;
				
				// Иначе если это документ, тогда.
			ИначеЕсли СимволыДляПоиска = "Документ" Тогда
				
				Если ИмяРеквизита = "Дата" Тогда
					МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Дата);
					
				ИначеЕсли ИмяРеквизита = "Номер" Тогда
					
					Если МетаОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Число Тогда
						МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Число);
					Иначе
						МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Строка);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если ИмяРеквизита = "ПометкаУдаления" Тогда
				МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Булево);
			КонецЕсли;
			
			Если Не ИмяРеквизита = "Без_Сопоставления"
				И МассивТипов.Количество() = 0 Тогда
				
				Если ТекущаяСтрока.ВидДанных = "Шапка" Тогда
					ТекРеквизит = МетаОбъекта.Реквизиты[ИмяРеквизита];
				ИначеЕсли Лев(ТекущаяСтрока.ВидДанных, 9) = "Движения_" Тогда 
					ТаблицаРеквизитов = ПолучитьРеквизитыОбъектаДляВыбора(ТекущаяСтрока.ВидДанных);
					ОписаниеРеквизита = ТаблицаРеквизитов.Найти(ИмяРеквизита, "ИмяРеквизита");
					Если ОписаниеРеквизита <> Неопределено Тогда
						ТекРеквизит = ОписаниеРеквизита.Реквизит;
					Иначе
						ТекРеквизит = Неопределено;
					КонецЕсли;
				Иначе
					ТекРеквизит = МетаОбъекта.ТабличныеЧасти[ТекущаяСтрока.ВидДанных].Реквизиты[ИмяРеквизита];
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли; // Если СимволыДляПоиска = "РегистрСведений" Тогда.
		
		Если ИмяРеквизита = "Без_Сопоставления" Тогда			
			ПеречислениеТипы = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel;			
			Для Каждого ТекТип Из ПеречислениеТипы Цикл
				МассивТипов.Добавить(ТекТип);
			КонецЦикла;			
			Возврат МассивТипов;
		КонецЕсли;
		
		Если ТекРеквизит <> Неопределено Тогда
			
			Если ТипЗнч(ТекРеквизит) = Тип("ОписаниеТипов") Тогда
				ТипыРеквизита = ТекРеквизит.Типы();
			Иначе
				ТипыРеквизита = ТекРеквизит.Тип.Типы();
			КонецЕсли;
		
			Для Каждого ТекТип Из ТипыРеквизита Цикл
				
				// Получим вид объекта реквизита.
				ВидОбъектаРеквизита = бит_ОбменДанными.ПолучитьВидОбъектаПоТипу(ТекТип);
				
				// Если это ссылочный тип, тогда.
				Если мСтруктураСсылочныхТипов.Свойство(ВидОбъектаРеквизита) Тогда
					
					РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъектаРеквизита];
					МассивТипов.Добавить(РезСтруктура.Тип);
					
				Иначе
					
					МассивТипов.Добавить(?(мСтруктураПростыхТипов.Получить(ТекТип) <> Неопределено, 
										   мСтруктураПростыхТипов[ТекТип].Тип, 
										   мСтруктураПростыхТипов[Тип("Строка")].Тип));
										   
				КонецЕсли;
				
			КонецЦикла;
		
		КонецЕсли; // Если Не ТекРеквизит = Неопределено Тогда
		
		МассивТипов.Добавить(Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.ПроизвольныйАлгоритм);
		
	Исключение
		
		Если Сообщать Тогда
			ТекстСообщения = НСтр("ru='Типы не получены для выбора. Неправильно указано имя реквизита.';
								  |en='Types are not received for selection. Incorrectly stated the name of the props.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецПопытки;
	
    Возврат МассивТипов;
    
КонецФункции // ТипыРеквизитаДляВыбора()

// Функция возвращает реквизиты объекта текущей строки 
// табличного поля ПравилаЗагрузки для выбора.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.
//  Сообщать      - Булево.
// 
// Возвращаемое значение:
//  ТаблицаРеквизитов - ТаблицаЗначений.
// 
Функция ПолучитьРеквизитыОбъектаТекущейСтрокиДляВыбора(ТекущаяСтрока, Сообщать = Истина) Экспорт
    
    ТаблицаРеквизитов = бит_ОбменДанными.ПолучитьРеквизитыОбъектаТекущейСтроки(мСтруктураСсылочныхТипов, ТекущаяСтрока, Сообщать);
    
    Возврат ТаблицаРеквизитов;
    
КонецФункции // ПолучитьРеквизитыОбъектаТекущейСтрокиДляВыбора()

// Функция формирует структуру дополнительных параметров правил загрузки реквизита.
//
// Возвращаемое значение:
//  Структура:
//   	ЭтоИзменениеТипа 		 - Булево (По умолчанию = Ложь).
//   	ПоРеквизитам 		     - Булево (По умолчанию = Ложь).
//   	ЭтоИзменениеИмениОбъекта - Булево (По умолчанию = Ложь).
//
Функция ДополнительныеПараметрыПравилЗагрузкиРеквизита() Экспорт

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭтоИзменениеТипа"		   , Ложь);
	ДополнительныеПараметры.Вставить("ПоРеквизитам"			   , Ложь);
	ДополнительныеПараметры.Вставить("ЭтоИзменениеИмениОбъекта", Ложь);
	
	Возврат ДополнительныеПараметры;
	
КонецФункции // ДополнительныеПараметрыПравилЗагрузкиРеквизита()

// Процедура заполняет значения правила загрузки реквизита.
// 
// Параметры:
//  ТекущаяСтрока     		- СтрокаТабЧасти.
//  ИмяРеквизита      		- Строка (По умолчанию = Неопределено). 
//  ТаблицаРеквизитов 		- ТаблицаЗначений (По умолчанию = Неопределено).
//  ДополнительныеПараметры - Структура (По умолчанию = Неопределено).
// 
Процедура ЗаполнитьЗначенияПравилаЗагрузкиРеквизита(ТекущаяСтрока, ИмяРеквизита = Неопределено, ТаблицаРеквизитов = Неопределено, 
	ДополнительныеПараметры = Неопределено) Экспорт
    
    Если ТекущаяСтрока = Неопределено Тогда
        Возврат
    КонецЕсли;
	
	// Дополнительные параметры.
	Если ДополнительныеПараметры = Неопределено Тогда
		ДополнительныеПараметры = ДополнительныеПараметрыПравилЗагрузкиРеквизита();
	КонецЕсли;
	ЭтоИзменениеТипа 		 = ДополнительныеПараметры.ЭтоИзменениеТипа;
	ПоРеквизитам 			 = ДополнительныеПараметры.ПоРеквизитам;
	ЭтоИзменениеИмениОбъекта = ДополнительныеПараметры.ЭтоИзменениеИмениОбъекта;
	
    Если (ЭтоИзменениеТипа Или ЭтоИзменениеИмениОбъекта)
        И ТекущаяСтрока.Тип = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.ПроизвольныйАлгоритм Тогда
        
		Если ТипЗнч(ТекущаяСтрока.ИмяОбъекта) <> Тип("СправочникСсылка.бит_ПользовательскиеФункции") Тогда
            ТекущаяСтрока.ИмяОбъекта = Справочники.бит_ПользовательскиеФункции.ПустаяСсылка();
        КонецЕсли;
        
        ТекущаяСтрока.РеквизитПоиска  = ""; 
        ТекущаяСтрока.ПоУмолчанию     = "";
        
        Если ИмяРеквизита = Неопределено Тогда
			ТекущаяСтрока.ТолькоДляПустых = Ложь;
        КонецЕсли;
        
    Иначе
		
		СимволыДляПроверки = ВидОбъекта;
		
        Если ИмяРеквизита = Неопределено Тогда
			
            ИмяРеквизита = ТекущаяСтрока.ИмяРеквизита;
            
            // Это очистка имени реквизита, очистим зависимые поля.
            Если ПустаяСтрока(ИмяРеквизита) Тогда
                
                ТекущаяСтрока.Тип = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.ПустаяСсылка();
                ТекущаяСтрока.ИмяОбъекта      = "";
                ТекущаяСтрока.РеквизитПоиска  = "";
                ТекущаяСтрока.ПоУмолчанию     = "";
                ТекущаяСтрока.КлючевоеПоле    = Ложь;
                ТекущаяСтрока.ТолькоДляПустых = Ложь;
				
            КонецЕсли;
            
        КонецЕсли;
        
        Если ТаблицаРеквизитов = Неопределено Тогда
            // Получим реквизиты объекта.
            ТаблицаРеквизитов = ПолучитьРеквизитыОбъектаДляВыбора(ТекущаяСтрока.ВидДанных);
        КонецЕсли;
        
        МассивДляПоиска = Новый Массив;
        
        // Сформируем массив с именами реквизитов в верхнем регистре.
        // Для осуществления поиска.
        Для Каждого ТекСтрока Из ТаблицаРеквизитов Цикл
            МассивДляПоиска.Добавить(ВРег(ТекСтрока.ИмяРеквизита));
        КонецЦикла;
		
		ЭтоСопоставление = (Не ТекущаяСтрока.ВидДанных = "Шапка" И Найти(ВРег(ИмяРеквизита), 
							ВРег(ТекущаяСтрока.ВидДанных + "_")) > 0);
		
		Если ЭтоСопоставление Тогда
			
			// Проверим наличие реквизита загружаемого объекта.
			ИндексСтроки = МассивДляПоиска.Найти(ВРег(ИмяРеквизита));
			
			Если ИндексСтроки = Неопределено Тогда
				ИмяРеквизитаДляПоиска = ВРег(СтрЗаменить(ВРег(ИмяРеквизита), ВРег(ТекущаяСтрока.ВидДанных + "_"), ""));
				ИндексСтроки 		  = МассивДляПоиска.Найти(ИмяРеквизитаДляПоиска);
			КонецЕсли;
			
		Иначе
			// Проверим наличие реквизита загружаемого объекта.
			ИндексСтроки = МассивДляПоиска.Найти(ВРег(ИмяРеквизита));
		КонецЕсли;
		
        // Если есть реквизит с именем колонки, тогда
        // заполним имя реквизита.
        Если ИндексСтроки <> Неопределено Тогда
            
            // Проверим наличие реквизита загружаемого объекта.
            НайденныйРеквизит = ТаблицаРеквизитов.Получить(ИндексСтроки);
            
            ИмяРеквизита = НайденныйРеквизит.ИмяРеквизита;
			
			// Заполняем имя реквизита.
            ТекущаяСтрока.ИмяРеквизита = ИмяРеквизита;
			
            НайденныйРеквизит = НайденныйРеквизит.Реквизит;
            
            // Если это не дополнительный реквизит, тогда.
			Если НайденныйРеквизит <> Неопределено Тогда
				
				Если ТипЗнч(НайденныйРеквизит) = Тип("ОписаниеТипов") Тогда
					ТипыРеквизита = НайденныйРеквизит.Типы();
				Иначе	
					ТипыРеквизита = НайденныйРеквизит.Тип.Типы();
				КонецЕсли;
				
				Если ТипыРеквизита.Количество() > 1 Тогда
					
					Если Не ЗначениеЗаполнено(ТекущаяСтрока.ИмяОбъекта)
						И Не ЗначениеЗаполнено(ТекущаяСтрока.РеквизитПоиска) Тогда
						
						Если Не ПоРеквизитам И Не ЗначениеЗаполнено(ТекущаяСтрока.ИмяВФайле) Тогда
							ДопТекст = ?(ТекущаяСтрока.ВидДанных = "Шапка", "", ТекущаяСтрока.ВидДанных + "_");
							ТекущаяСтрока.ИмяВФайле = ДопТекст + ИмяРеквизита;
						КонецЕсли;
						
						Если Не (ЭтоИзменениеТипа Или ЭтоИзменениеИмениОбъекта) Тогда
							ТекущаяСтрока.Тип = "";
						КонецЕсли;
						
						Возврат;
					КонецЕсли;				
						
						Если Не ЭтоИзменениеИмениОбъекта Тогда
							
							Если Не ЭтоИзменениеТипа Тогда
								ТекущаяСтрока.Тип = "";
							КонецЕсли;
							
							ТекущаяСтрока.ИмяОбъекта      = "";
							ТекущаяСтрока.РеквизитПоиска  = "";
							ТекущаяСтрока.ПоУмолчанию     = Неопределено;
							ТекущаяСтрока.ТолькоДляПустых = Ложь;
							
							Возврат;
						КонецЕсли;
						
						ТекстТипа = СтрЗаменить(ТекущаяСтрока.Тип, " ", "") + "." + ТекущаяСтрока.ИмяОбъекта;
						
					// КонецЕсли;
					
					ПервыйТипТипов = Тип(ТекстТипа);
					
				Иначе
					ПервыйТипТипов = ТипыРеквизита[0];
				КонецЕсли;
				
				// Получим вид объекта реквизита.
				ВидОбъектаРеквизита = бит_ОбменДанными.ПолучитьВидОбъектаПоТипу(ПервыйТипТипов);
				
            Иначе
                // Иначе - это дополнительный реквизит.
				
				// Если это регистр сведений, тогда
				Если СимволыДляПроверки = "РегистрСведений" Тогда
					
					Если ИмяРеквизита = "Период" Тогда
						ПервыйТипТипов = Тип("Дата");
					КонецЕсли;
					
				Иначе
				    // Иначе, если это не регистр сведений.
					
					Если ИмяРеквизита = "Код" Тогда
						
						РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъекта];
						МетаОбъекта  = Метаданные[РезСтруктура.ИмяКоллекции][ИмяОбъекта];
						
						Если МетаОбъекта.ТипКода = Метаданные.СвойстваОбъектов.ТипКодаСправочника.Число Тогда
							ПервыйТипТипов = Тип("Число");
						Иначе
							ПервыйТипТипов = Тип("Строка");
						КонецЕсли;
						
					ИначеЕсли ИмяРеквизита = "Наименование" Тогда
						ПервыйТипТипов = Тип("Строка");
						
					ИначеЕсли ИмяРеквизита = "ЭтоГруппа" Тогда
						ПервыйТипТипов = Тип("Булево");
						
					ИначеЕсли ИмяРеквизита = "Родитель" Тогда
						ПервыйТипТипов = Тип("СправочникСсылка." + ИмяОбъекта);
						
					ИначеЕсли ИмяРеквизита = "Владелец" Тогда
						
						РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъекта];
						МетаОбъекта  = Метаданные[РезСтруктура.ИмяКоллекции][ИмяОбъекта];
						
						ТекИмяОбъекта     = ТекущаяСтрока.ИмяОбъекта;
						ИмяОбъектаУказано = ЗначениеЗаполнено(ТекИмяОбъекта);
						
						Для Каждого ТекВладелец Из МетаОбъекта.Владельцы Цикл
							
							// Получим текущий вид объекта.
							ТекВидОбъекта = бит_ОбменДанными.ПолучитьВидОбъектаПоМетаданным(ТекВладелец);
							
							// Получим имя типа объекта.
							ПервыйТипТипов = Тип(бит_ОбменДанными.ПолучитьИмяТипаОбъекта(ТекВладелец.Имя, ТекВидОбъекта));
							
							Если Не ЭтоИзменениеИмениОбъекта 
								Или (ЭтоИзменениеИмениОбъекта 
								И ИмяОбъектаУказано 
								И ТекВладелец.Имя = ТекИмяОбъекта) Тогда
								Прервать;
							КонецЕсли;
							
						КонецЦикла;
						
					ИначеЕсли ИмяРеквизита = "Дата" Тогда
						ПервыйТипТипов = Тип("Дата");
						
					ИначеЕсли ИмяРеквизита = "Номер" Тогда
						
						РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъекта];
						МетаОбъекта  = Метаданные[РезСтруктура.ИмяКоллекции][ИмяОбъекта];
						
						Если МетаОбъекта.ТипНомера = Метаданные.СвойстваОбъектов.ТипНомераДокумента.Число Тогда
							ПервыйТипТипов = Тип("Число");
						Иначе
							ПервыйТипТипов = Тип("Строка");
						КонецЕсли;
						
					ИначеЕсли ИмяРеквизита = "ПометкаУдаления" Тогда
						ПервыйТипТипов = Тип("Булево");  
						
					КонецЕсли; // Если ИмяРеквизита = "Код" Тогда
					
				КонецЕсли; // Если СимволыДляПроверки = "РегистрСведений" Тогда.
				
				Если ИмяРеквизита = "Без_Сопоставления" Тогда
					
					Если ЭтоИзменениеИмениОбъекта
						И ЗначениеЗаполнено(ТекущаяСтрока.ИмяОбъекта) Тогда
						
						ПервыйТипТипов = Тип(СтрЗаменить(ТекущаяСтрока.Тип, " ", "")
										 + "." + ТекущаяСтрока.ИмяОбъекта);
						
					Иначе
						ПервыйТипТипов = "Все";  
					КонецЕсли;
					
				КонецЕсли;
				
				// Получим вид объекта реквизита.
				ВидОбъектаРеквизита = бит_ОбменДанными.ПолучитьВидОбъектаПоТипу(ПервыйТипТипов);
				
            КонецЕсли;
            
			Если Не ПоРеквизитам И Не ЗначениеЗаполнено(ТекущаяСтрока.ИмяВФайле) Тогда
				ДопТекст = ?(ТекущаяСтрока.ВидДанных = "Шапка", "", ТекущаяСтрока.ВидДанных + "_");
                ТекущаяСтрока.ИмяВФайле = ДопТекст + ИмяРеквизита;
            КонецЕсли;
            
            // Если это ссылочный тип, тогда
            Если мСтруктураСсылочныхТипов.Свойство(ВидОбъектаРеквизита) Тогда
                
                РезСтруктура = мСтруктураСсылочныхТипов[ВидОбъектаРеквизита];
                
                МассивТипов = Новый Массив;
                МассивТипов.Добавить(ПервыйТипТипов);
                ОписаниеТипов = Новый ОписаниеТипов(МассивТипов);
                
                СтруктураОбъекта = бит_ОбменДанными.ПолучитьИмяОбъектаПоОписаниюТипов(ОписаниеТипов, 
                                                                                            РезСтруктура.ИмяКоллекции,
                                                                                            РезСтруктура.НачалоИмениТипа + "Ссылка");
                Если Не СтруктураОбъекта = Неопределено Тогда
					
					// Заполняем тип объекта.
	                ТекущаяСтрока.Тип = РезСтруктура.Тип;
					
	                // Заполняем имя ссылочного объекта.
	                ТекущаяСтрока.ИмяОбъекта = СтруктураОбъекта.Имя;
					
					Если ЗначениеЗаполнено(ТекущаяСтрока.РеквизитПоиска) Тогда
						// Проверим принадлежность реквизита поиска к реквизитам выбранного объекта.
						ПроверитьПринадлежностьРеквизитаКРеквизитамОбъекта(ТекущаяСтрока);
					Иначе
						// Заполняем реквизит поиска по умолчанию.
						ТекущаяСтрока.РеквизитПоиска = мСтруктураРеквизитПоиска[ВидОбъектаРеквизита];
					КонецЕсли;
	    			
	    			// Приведем значение типа по умолчанию.
	    			Выполнить("ТекущаяСтрока.ПоУмолчанию = " + РезСтруктура.ИмяКоллекции + "." 
	    												  + СтруктураОбъекта.Имя + ".ПустаяСсылка();");
    			Иначе
					
					ТекущаяСтрока.Тип 			 = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.ПустаяСсылка();
					ТекущаяСтрока.ИмяОбъекта     = "";
					ТекущаяСтрока.РеквизитПоиска = "";
					ТекущаяСтрока.ПоУмолчанию    = Неопределено;
					
				КонецЕсли;
    		Иначе

				
				Если ПервыйТипТипов = "Все" Тогда
					ПервыйТипТипов = ?(ЗначениеЗаполнено(ТекущаяСтрока.Тип), ТекущаяСтрока.Тип, ПервыйТипТипов);
				КонецЕсли;
				
				Если мСтруктураПростыхТипов.Получить(ПервыйТипТипов) <> Неопределено Тогда
					ТекущаяСтрока.Тип = мСтруктураПростыхТипов[ПервыйТипТипов].Тип;
				КонецЕсли;
				
                ТекущаяСтрока.ИмяОбъекта     = "";
                ТекущаяСтрока.РеквизитПоиска = "";
    			
    			Попытка
    				// Приведем значение типа по умолчанию.
    				Выполнить("ТекущаяСтрока.ПоУмолчанию = мСтруктураПростыхТипов[ПервыйТипТипов].Значение;");
                Исключение
                    // Если потерпели неудачу при установке типа, тогда
    				// приведем значение типа по умолчанию - Строка.
    				Выполнить("ТекущаяСтрока.ПоУмолчанию = """";");
    			КонецПопытки;
                
            КонецЕсли; // Если мСтруктураСсылочныхТипов.Свойство(ВидОбъектаРеквизита) Тогда.
            
        Иначе
            
            // Иначе, если не нашли реквизит.
            Если Не ЭтоИзменениеТипа И Не ПустаяСтрока(ТекущаяСтрока.ИмяРеквизита) Тогда
                ТекущаяСтрока.Тип = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel.Строка;
            КонецЕсли;
            
            ТекущаяСтрока.ИмяОбъекта     = "";
            ТекущаяСтрока.РеквизитПоиска = ""; 
            ТекущаяСтрока.ПоУмолчанию    = "";
            
            Если ИмяРеквизита = Неопределено Тогда
                ТекущаяСтрока.КлючевоеПоле    = Ложь;
                ТекущаяСтрока.ТолькоДляПустых = Ложь;
            КонецЕсли;
            
        КонецЕсли; // Если ИндексСтроки <> Неопределено Тогда
    
    КонецЕсли;
    
КонецПроцедуры // ЗаполнитьЗначенияПравилаЗагрузкиРеквизита()

// Процедура проверяет принадлежность элемента/группы к предопределеннм группам справочника.
// 
// Параметры:
//  Отказ - Булево, флаг отказа ввода настройки.
// 
Процедура ПроверитьПринадлежностьНастройкиКПредопределеннымГруппам(Отказ) Экспорт

    ПредГруппы = Справочники.бит_НастройкиЗагрузкиИзExcel;
    
    // Проверим принадлежность элемента к предопределенным группам.
    Если НЕ (Предопределенный
		ИЛИ ПринадлежитЭлементу(ПредГруппы.Справочники)
        ИЛИ ПринадлежитЭлементу(ПредГруппы.Документы)
        ИЛИ ПринадлежитЭлементу(ПредГруппы.РегистрыСведений)) Тогда
        Отказ = Истина;
		Если ЭтоГруппа Тогда
			ТекстСообщения = НСтр("ru='Группа может принадлежать только предопределенным группам';
								  |en='The group can only belong to some predefined groups'");
		Иначе	
			ТекстСообщения = НСтр("ru='Элемент может принадлежать только предопределенным группам';
								  |en='Element can only belong to some predefined groups'");
		КонецЕсли;
        ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
    КонецЕсли;
    
    // Перемещение между группами запрешено.
    Если Не ЭтоНовый() 
        И Ссылка.Родитель <> Родитель Тогда
        
        ТекРодитель = Ссылка.Родитель;
        НовРодитель = Родитель;
        
        Если Не ЗначениеЗаполнено(НовРодитель)
            Или Не (((ТекРодитель = ПредГруппы.Справочники Или ТекРодитель.ПринадлежитЭлементу(ПредГруппы.Справочники))
            И НовРодитель = ПредГруппы.Справочники Или НовРодитель.ПринадлежитЭлементу(ПредГруппы.Справочники))
            
            Или ((ТекРодитель = ПредГруппы.Документы Или ТекРодитель.ПринадлежитЭлементу(ПредГруппы.Документы))
                 И НовРодитель = ПредГруппы.Документы Или НовРодитель.ПринадлежитЭлементу(ПредГруппы.Документы))
            
            Или ((ТекРодитель = ПредГруппы.РегистрыСведений Или ТекРодитель.ПринадлежитЭлементу(ПредГруппы.РегистрыСведений))
                 И НовРодитель = ПредГруппы.РегистрыСведений Или НовРодитель.ПринадлежитЭлементу(ПредГруппы.РегистрыСведений))) Тогда
            
            Отказ = Истина;
            ТекстСообщения = НСтр("ru='Перемещение между предопределенными группами запрещено';
								  |en='Moving between predefined groups is prohibited'");
            ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			ТекстСообщения = НСтр("ru='*** Перемещение разрешено только внутри предопределенных групп. ***';
								  |en='*** Moving is allowed only within the predefined groups. ***'");
            ОбщегоНазначения.СообщитьПользователю(Символы.НПП + ТекстСообщения);
            
        КонецЕсли;
        
    КонецЕсли;
    
КонецПроцедуры // ПроверитьПринадлежностьНастройкиКПредопределеннымГруппам()

// Процедура проверяет правильность заполнения настройки загрузки.
// 
// Параметры:
//  Отказ - Булево, флаг правильности заполнения настройки загрузки.
// 
Процедура ПроверитьПравильностьЗаполненияНастройкиЗагрузки(Отказ) Экспорт
    
    Заголовок = НСтр("ru = 'Проверка правильности настройки правил загрузки.'; 
					 |en = 'Проверка правильности настройки правил загрузки.'");
    
    СтруктураСвойстОбъекта = Новый Структура;
    СтруктураСвойстОбъекта.Вставить("ВидОбъекта", ВидОбъекта);
    СтруктураСвойстОбъекта.Вставить("ИмяОбъекта", ИмяОбъекта);
    СтруктураСвойстОбъекта.Вставить("ИспользоватьНестандартныйАлгоритмПоиска", ИспользоватьНестандартныйАлгоритмПоиска);
	
    // Проверим правильность заполнения настройки загрузки.
    бит_ОбменДанными.ПроверитьПравильностьЗаполненияНастройкиЗагрузки(ПравилаЗагрузки.Выгрузить(), СтруктураСвойстОбъекта, Отказ, Заголовок);
    
КонецПроцедуры // ПроверитьПравильностьЗаполненияНастройкиЗагрузки()

// Функция получаем структуру имен объектов для поля без сопоставления реквизита.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТабличнойЧасти.
// 
// Возвращаемое значение:
//  СтруктураИмен - Структура.
// 
Функция ИменаОбъектовДляПоляБезСопоставления(ТекущаяСтрока) Экспорт
	
	СтруктураИмен = мСоотИменТиповДляПолейБезСопоставления.Получить(ТекущаяСтрока.Тип);
	
	Если СтруктураИмен = Неопределено Тогда
		
		СтруктураИмен = Новый Структура;
		СтруктураИмен.Вставить("СписокИмен");
		СтруктураИмен.Вставить("СинонимКоллекции");
		
	КонецЕсли;
	
	Возврат СтруктураИмен;
	
КонецФункции // ИменаОбъектовДляПоляБезСопоставления()

// Процедура удаляет из таблицы значений строку со значением "Без_Сопоставления".
// 
// Параметры:
//  ТаблицаРеквизитов - ТаблицаЗначений.
// 
Процедура УдалитьСтрокуСоЗначением_Без_Сопоставления(ТаблицаРеквизитов) Экспорт
	
	СтрокаДляУдаления = ТаблицаРеквизитов.Найти("Без_Сопоставления", "ИмяРеквизита");
	
	Если Не СтрокаДляУдаления = Неопределено Тогда
		ТаблицаРеквизитов.Удалить(СтрокаДляУдаления);
	КонецЕсли;
	
КонецПроцедуры // УдалитьСтрокуСоЗначением_Без_Сопоставления()

// Процедура проверяет принадлежность реквизита поиска в реквизитам объекта.
// 
// Параметры:
//  ТекущаяСтрока - СтрокаТаблицыЗначений.
// 
Процедура ПроверитьПринадлежностьРеквизитаКРеквизитамОбъекта(ТекущаяСтрока) Экспорт

	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
        
	РеквизитЗаполнен = ЗначениеЗаполнено(ТекущаяСтрока.РеквизитПоиска);
	
	Если РеквизитЗаполнен Тогда
		
		// Получаем реквизиты текущего объекта для проверки правильности указания имени реквизита поиска.
		ТаблицаРеквизитов = бит_ОбменДанными.ПолучитьРеквизитыОбъектаТекущейСтроки(мСтруктураСсылочныхТипов, ТекущаяСтрока);
		
		МассивДляПоиска = Новый Массив;
		
		// Сформируем массив с именами реквизитов в верхнем регистре.
		// Для осуществления поиска.
		Для Каждого ТекСтрока Из ТаблицаРеквизитов Цикл
			МассивДляПоиска.Добавить(ВРег(ТекСтрока.ИмяРеквизита));
		КонецЦикла;
		
		// Проверим наличие реквизита у объекта.
		// Если реквизит не найден, тогда. 
		Если МассивДляПоиска.Найти(ВРег(ТекущаяСтрока.РеквизитПоиска)) = Неопределено Тогда
			ТекущаяСтрока.РеквизитПоиска = "";
		КонецЕсли;
		
	КонецЕсли;
    
КонецПроцедуры // ПроверитьПринадлежностьРеквизитаКРеквизитамОбъекта()

// Процедура заполняет таблицу правил загрузки дополнительными значениями.
// 
// Параметры:
//  ПравилаЗагрузки - ТаблицаЗначений.
//  ПоРеквизитам    - Булево.
// 
Процедура ДополнитьИЗагрузитьТаблицуПравилЗагрузки(НовПравилаЗагрузки, ПоРеквизитам = Ложь) Экспорт
    
    МассивТипов = Новый Массив;
    МассивТипов.Добавить("");
    
    // Добавим новые колонки.
    Если Не ПоРеквизитам Тогда
        НовПравилаЗагрузки.Колонки.Добавить("ИмяРеквизита",   Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	КонецЕсли;
    НовПравилаЗагрузки.Колонки.Добавить("Тип",            Новый ОписаниеТипов("ПеречислениеСсылка.бит_ТипыЗагружаемыхОбъектовИзExcel"));
    НовПравилаЗагрузки.Колонки.Добавить("ИмяОбъекта",     Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
    НовПравилаЗагрузки.Колонки.Добавить("РеквизитПоиска", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
    НовПравилаЗагрузки.Колонки.Добавить("ПоУмолчанию",    Новый ОписаниеТипов(МассивТипов));
    
    Если Не ПоРеквизитам Тогда
        
        Для Каждого ТекСтрока Из НовПравилаЗагрузки Цикл
            
            ТекИмяКолонки = ТекСтрока.ИмяВФайле;
			
			// Получим реквизиты объекта.
			ТаблицаРеквизитов = ПолучитьРеквизитыОбъектаДляВыбора(ТекСтрока.ВидДанных);
			
            // Заполним значения в текущей строке.
            ЗаполнитьЗначенияПравилаЗагрузкиРеквизита(ТекСтрока, ТекИмяКолонки, ТаблицаРеквизитов);
            
        КонецЦикла;
        
    Иначе
        
        Для Каждого ТекСтрока Из НовПравилаЗагрузки Цикл
            // Заполним значения в текущей строке.
            ДополнительныеПараметры = ДополнительныеПараметрыПравилЗагрузкиРеквизита();
			ДополнительныеПараметры.ПоРеквизитам = ПоРеквизитам;
            ЗаполнитьЗначенияПравилаЗагрузкиРеквизита(ТекСтрока,,, ДополнительныеПараметры);
        КонецЦикла;
        
    КонецЕсли;
    
    ПравилаЗагрузки.Загрузить(НовПравилаЗагрузки);
    
КонецПроцедуры // ДополнитьИЗагрузитьТаблицуПравилЗагрузки()

#КонецОбласти

#Область Инициализация

мЖирныйШрифт = Новый Шрифт("Arial",8,Истина);

// Получим структуру имен простейщих типов.
мСтруктураПростыхТипов = бит_ОбменДанными.ИменаПростейщихТиповДляЗагрузки();

// Получим структуру имен - ссылочных типов.
мСтруктураСсылочныхТипов = бит_ОбменДанными.ИменаСсылочныхТиповДляЗагрузки();

// Получим соответствие имен - ссылочных типов для полей без сопоставления.
мСоотИменТиповДляПолейБезСопоставления = бит_ОбменДанными.ИменаСсылочныхТиповДляПолейБезСопоставленияРеквизиту();

// Получим соответствие тип - вид объекта.
мСоотТипВидОбъекта = бит_ОбменДанными.ТипыИВидыЗагружаемыхОбъектов();

// Формируем структуру имен - реквизитов поиска по умолчанию.
мСтруктураРеквизитПоиска = Новый Структура;
мСтруктураРеквизитПоиска.Вставить("Справочник"			  , "Код");
мСтруктураРеквизитПоиска.Вставить("Документ"			  , "Номер");
мСтруктураРеквизитПоиска.Вставить("Перечисление"		  , "");
мСтруктураРеквизитПоиска.Вставить("ПланВидовХарактеристик", "Код");
мСтруктураРеквизитПоиска.Вставить("ПланСчетов"			  , "Код");
мСтруктураРеквизитПоиска.Вставить("ПланВидовРасчета"	  , "Код");
мСтруктураРеквизитПоиска.Вставить("ПланОбмена"			  , "Код");

	
// Формируем соответствие картинок типов.
МенеджерТипы  = Перечисления.бит_ТипыЗагружаемыхОбъектовИзExcel;
мКартинкиТипов = Новый Соответствие;
мКартинкиТипов.Вставить(МенеджерТипы.СправочникСсылка 	   		 , БиблиотекаКартинок.СправочникОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ДокументСсылка   	   		 , БиблиотекаКартинок.ДокументОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ПеречислениеСсылка	   		 , БиблиотекаКартинок.Перечисление);
мКартинкиТипов.Вставить(МенеджерТипы.ПланВидовХарактеристикСсылка, БиблиотекаКартинок.ПланВидовХарактеристикОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ПланСчетовСсылка 	   		 , БиблиотекаКартинок.ПланСчетовОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ПланВидовРасчетаСсылка		 , БиблиотекаКартинок.ПланВидовРасчетаОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ПланОбменаСсылка 	   		 , БиблиотекаКартинок.ПланОбменаОбъект);
мКартинкиТипов.Вставить(МенеджерТипы.ПроизвольныйАлгоритм  		 , БиблиотекаКартинок.бит_од_ФункцииПолученияЗначения);


мЦветНеДоступно = WebЦвета.Лимонный;

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
